app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "A completely new article"], ["description", "testing testing"], ["created_at", "2021-01-31 15:26:16.399546"], ["updated_at", "2021-01-31 15:26:16.399546"]]
---
    def create
        @article = Article.new(params.require(:article).permit(:title, :description))

        if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Updated article"], ["description", "Updated description"], ["updated_at", "2021-01-24 13:59:43.520025"], ["id", 1]]
---
    def update
        @article = Article.find(params[:id])
        if @article.update(params.require(:article).permit(:title, :description))